In [2]:
import pandas as pd 
houses = pd.read_csv(r"C:\Users\Hossam\Desktop\data visualiztion\DataAnalysisCourseMaterials\DataAnalysis\data\kc_house_data.csv")
titanic = pd.read_csv(r'C:\Users\Hossam\Desktop\data visualiztion\DataAnalysisCourseMaterials\DataAnalysis\data\titanic.csv')
netflix = pd.read_csv(r'C:\Users\Hossam\Desktop\data visualiztion\DataAnalysisCourseMaterials\DataAnalysis\data\netflix_titles.csv',sep = '|',index_col = 0)
btc = pd.read_csv(r'C:\Users\Hossam\Desktop\data visualiztion\DataAnalysisCourseMaterials\DataAnalysis\data\coin_Bitcoin.csv')
countries = pd.read_csv(r'C:\Users\Hossam\Desktop\data visualiztion\DataAnalysisCourseMaterials\DataAnalysis\data\world-happiness-report-2021.csv')

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1309 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: int64(4), object(10)
memory usage: 143.3+ KB

In [4]:
titanic.age.value_counts()

?         263
24         47
22         43
21         41
30         40
         ...
66          1
0.6667      1
76          1
67          1
26.5        1
Name: age, Length: 99, dtype: int64

In [5]:
titanic['age'].replace(['?'],[None],inplace = True)

In [6]:
titanic.age.value_counts()

24        47
22        43
21        41
30        40
18        39
          ..
0.3333     1
22.5       1
70.5       1
0.6667     1
26.5       1
Name: age, Length: 98, dtype: int64

In [7]:
titanic['age'].astype('float')

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305        NaN
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

In [8]:
titanic.age.dtype

dtype('O')

In [9]:
titanic['age'] = titanic['age'].astype('float')

In [10]:
titanic.age

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305        NaN
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

In [11]:
titanic.age.dtype

dtype('float64')

In [12]:
titanic['sex'].value_counts()

male      843
female    466
Name: sex, dtype: int64

In [13]:
titanic.sex = titanic.sex.astype('category')

In [14]:
titanic.sex.dtype

CategoricalDtype(categories=['female', 'male'], ordered=False)

In [15]:
titanic.sex = 'MALE'

In [16]:
titanic.sex

0       MALE
1       MALE
2       MALE
3       MALE
4       MALE
        ...
1304    MALE
1305    MALE
1306    MALE
1307    MALE
1308    MALE
Name: sex, Length: 1309, dtype: object

In [17]:
titanic.embarked.value_counts()

S    914
C    270
Q    123
?      2
Name: embarked, dtype: int64

In [18]:
titanic.embarked = titanic.embarked.astype('category')

In [19]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   category
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: category(1), float64(1), int64(4), object(8)
memory usage: 134.5+ KB

In [20]:
titanic = pd.read_csv(r'C:\Users\Hossam\Desktop\data visualiztion\DataAnalysisCourseMaterials\DataAnalysis\data\titanic.csv')
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,?,C,?,328,?
1305,3,0,"Zabour, Miss. Thamine",female,?,1,0,2665,14.4542,?,C,?,?,?
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.225,?,C,?,304,?
1307,3,0,"Zakarian, Mr. Ortin",male,27,0,0,2670,7.225,?,C,?,?,?
1308,3,0,"Zimmerman, Mr. Leo",male,29,0,0,315082,7.875,?,S,?,?,?

In [21]:
titanic.age.value_counts()

?         263
24         47
22         43
21         41
30         40
         ...
66          1
0.6667      1
76          1
67          1
26.5        1
Name: age, Length: 99, dtype: int64

In [22]:
titanic['age'] = pd.to_numeric(titanic['age'],errors = 'coerce')

In [23]:
titanic['age']

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305        NaN
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

In [24]:
sales = pd.read_csv(r'C:\Users\Hossam\Desktop\data visualiztion\DataAnalysisCourseMaterials\DataAnalysis\data\sales.csv')
stats = pd.read_csv(r'C:\Users\Hossam\Desktop\data visualiztion\DataAnalysisCourseMaterials\DataAnalysis\data\game_stats.csv')

In [25]:
stats

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie         NaN    10.0      NaN       2.0
2       stu  euroleague     NaN      NaN       NaN
3   jackson         aba     9.0      NaN       2.0
4  timothee         NaN     8.0      NaN       NaN
5     steph         nba    49.0      8.0      10.0
6       NaN         NaN     NaN      NaN       NaN

In [26]:
stats.isna()

    name  league  points  assists  rebounds
0  False   False   False    False     False
1  False    True   False     True     False
2  False   False    True     True      True
3  False   False   False     True     False
4  False    True   False     True      True
5  False   False   False    False     False
6   True    True    True     True      True

In [31]:
stats[~stats['name'].isna()]

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie         NaN    10.0      NaN       2.0
2       stu  euroleague     NaN      NaN       NaN
3   jackson         aba     9.0      NaN       2.0
4  timothee         NaN     8.0      NaN       NaN
5     steph         nba    49.0      8.0      10.0

In [32]:
stats['assists'].dropna()

0    5.0
5    8.0
Name: assists, dtype: float64

In [33]:
stats.dropna()

    name league  points  assists  rebounds
0    bob    nba    22.0      5.0      10.0
5  steph    nba    49.0      8.0      10.0

In [34]:
stats.dropna(how = 'all')

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie         NaN    10.0      NaN       2.0
2       stu  euroleague     NaN      NaN       NaN
3   jackson         aba     9.0      NaN       2.0
4  timothee         NaN     8.0      NaN       NaN
5     steph         nba    49.0      8.0      10.0

In [35]:
stats

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie         NaN    10.0      NaN       2.0
2       stu  euroleague     NaN      NaN       NaN
3   jackson         aba     9.0      NaN       2.0
4  timothee         NaN     8.0      NaN       NaN
5     steph         nba    49.0      8.0      10.0
6       NaN         NaN     NaN      NaN       NaN

In [36]:
stats.dropna(subset = ['league'])

      name      league  points  assists  rebounds
0      bob         nba    22.0      5.0      10.0
2      stu  euroleague     NaN      NaN       NaN
3  jackson         aba     9.0      NaN       2.0
5    steph         nba    49.0      8.0      10.0

In [37]:
stats.dropna(subset = ['league','points'])

      name league  points  assists  rebounds
0      bob    nba    22.0      5.0      10.0
3  jackson    aba     9.0      NaN       2.0
5    steph    nba    49.0      8.0      10.0

In [38]:
stats.dropna(axis = 'columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [39]:
stats.dropna(axis = 'index')

    name league  points  assists  rebounds
0    bob    nba    22.0      5.0      10.0
5  steph    nba    49.0      8.0      10.0

In [40]:
stats.fillna(0)

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie           0    10.0      0.0       2.0
2       stu  euroleague     0.0      0.0       0.0
3   jackson         aba     9.0      0.0       2.0
4  timothee           0     8.0      0.0       0.0
5     steph         nba    49.0      8.0      10.0
6         0           0     0.0      0.0       0.0

In [43]:
stats['league'].fillna("amateur",inplace = True)

In [44]:
stats

       name      league  points  assists  rebounds
0       bob         nba    22.0      5.0      10.0
1    jessie     amateur    10.0      NaN       2.0
2       stu  euroleague     NaN      NaN       NaN
3   jackson         aba     9.0      NaN       2.0
4  timothee     amateur     8.0      NaN       NaN
5     steph         nba    49.0      8.0      10.0
6       NaN     amateur     NaN      NaN       NaN

In [45]:
stats.fillna({'points': 0 ,'assists':'Nope'},inplace = True)

In [46]:
stats

       name      league  points assists  rebounds
0       bob         nba    22.0     5.0      10.0
1    jessie     amateur    10.0    Nope       2.0
2       stu  euroleague     0.0    Nope       NaN
3   jackson         aba     9.0    Nope       2.0
4  timothee     amateur     8.0    Nope       NaN
5     steph         nba    49.0     8.0      10.0
6       NaN     amateur     0.0    Nope       NaN

In [47]:
sales

   rating  shipping_zip  billing_zip
0     5.0           NaN      81220.0
1     4.5       94931.0      94931.0
2     NaN       92625.0      92625.0
3     4.5       10003.0      10003.0
4     4.0           NaN      92660.0
5     NaN           NaN          NaN
6     NaN       60007.0      60007.0

In [49]:
sales['shipping_zip'].fillna(sales['billing_zip'],inplace=True)

In [52]:
sales.dropna(how = 'all')

   rating  shipping_zip  billing_zip
0     5.0       81220.0      81220.0
1     4.5       94931.0      94931.0
2     NaN       92625.0      92625.0
3     4.5       10003.0      10003.0
4     4.0       92660.0      92660.0
6     NaN       60007.0      60007.0

In [53]:
sales

   rating  shipping_zip  billing_zip
0     5.0       81220.0      81220.0
1     4.5       94931.0      94931.0
2     NaN       92625.0      92625.0
3     4.5       10003.0      10003.0
4     4.0       92660.0      92660.0
5     NaN           NaN          NaN
6     NaN       60007.0      60007.0